// Задачи для решения
// Работа с переменными
// Создайте переменную num и присвойте ей значение 3. Выведите значение этой переменной на экран с помощью метода alert.Показать решение.
/* let num = 3;
alert(num); */
// Создайте переменные a = 10 и b = 2. Выведите на экран их сумму, разность, произведение и частное(результат деления).Показать решение.
/* var a = 10,
  b = 2;
alert(a + b);
alert(a - b);
alert(a * b);
alert(a / b); */
// Создайте переменные c = 15 и d = 2. Просуммируйте их, а результат присвойте переменной result.Выведите на экран значение переменной result.Показать решение.
/* var c = 10,
  d = 2;
var result = c + d;
alert(result); */

// Создайте переменные a = 10, b = 2 и c = 5. Выведите на экран их сумму.Показать решение.
/* var a = 10,
  b = 2,
  c = 5;
alert(a + b + c);
 */
// Создайте переменные a = 17 и b = 10. Отнимите от a переменную b и результат присвойте переменной c.Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result.Выведите на экран значение переменной result.Показать решение.
/* var a = 17,
  b = 10;
var c = a - b;
var d = 7;
var result = c + d;
console.log(result);
 */
// Работа со строками
// Создайте переменную str и присвойте ей значение 'Привет, Мир!'.Выведите значение этой переменной на экран.Показать решение.
var str = "Привет, Мир!";
console.log(str);

// Создайте переменные str1 = 'Привет, ' и str2 = 'Мир!'.С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.Показать решение.
var str1 = "Привет, ",
  str2 = "Мир!";
console.log(str1 + str2);

// Создайте переменную name и присвойте ей ваше имя.Выведите на экран фразу 'Привет, %Имя%!'.Показать решение.
var name = "EvgeniUPS";
console.log("Hello " + name);

// Создайте переменную age и присвойте ей ваш возраст.Выведите на экран 'Мне %Возраст% лет!'.Показать решение.
var age = 36;
console.log("Мне " + age + " лет!");

// Функция prompt
// Спросите имя пользователя с помощью методы prompt.Выведите с помощью alert сообщение 'Ваше имя %имя%'.Показать решение.
// var name = prompt("Name");
console.log("My name is " + name);

// Спросите у пользователя число.Выведите с помощью alert квадрат этого числа.Показать решение.

// Обращение к символам строки
// Создайте переменную str и присвойте ей значение 'abcde'.Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'.Показать решение.
var str = "abcde";
alert(str[0]); //выведем букву 'a'
alert(str[2]); //выведем букву 'c'
alert(str[4]); //выведем букву 'e'

// Создайте переменную num и присвойте ей значение '12345'.Найдите произведение(умножение) цифр этого числа.Показать решение.

//   Практика
// Напишите скрипт, который считает количество секунд в часе, в сутках, в месяце.Показать решение.

// Создайте три переменные - час, минута, секунда.С их помощью выведите текущее время в формате 'час:минута:секунда'.Показать решение.

// Создайте переменную, присвойте ей число.Возведите это число в квадрат.Выведите его на экран.Показать решение.

// Работа с присваиванием и декрементами
// Переделайте этот код так, чтобы в нем использовались операции +=, -=, *=, /=. Количество строк кода при этом не должно измениться.

// var num = 47;
// num = num + 7;
// num = num - 18;
// num = num * 10;
// num = num / 15;
// alert(num);
// Показать решение.

// Переделайте этот код так, чтобы в нем использовались операции++ и--.Количество строк кода при этом не должно измениться.

// var num = 10;
// num = num + 1;
// num = num + 1;
// num = num - 1;
// alert(num);
// Показать решение.
